app/controllers/foods_controller.rb

INSERT INTO "foods" ("name", "measurement_unit", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "aaaa"], ["measurement_unit", "11"], ["price", "33.0"], ["user_id", 1], ["created_at", "2022-01-14 20:30:22.830736"], ["updated_at", "2022-01-14 20:30:22.830736"]]
---
  def create
    @food = current_user.foods.build(food_params)
    if @food.save

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 1]]
---
  def destroy
    @food = Food.find(params[:id])
    authorize! :destroy, @food
    @food.destroy