app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("name", "preparation_time", "cooking_time", "description", "public", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @recipe = current_user.recipes.build(recipe_params)
    flash[:notice] = 'Recipe successfully added!' if @recipe.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 1]]
---
  def destroy
    @recipe = Recipe.find(params[:id])
    authorize! :destroy, @recipe
    @recipe.destroy